src/Catalogs/Вопросы/Вопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вопросы</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыЭкзамена</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Вопросы/ManagerModule.bsl
Функция ПодобратьВопрос(Вид, Раздел) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Вопросы.Ссылка
		|ИЗ
		|	Справочник.Вопросы КАК Вопросы
		|ГДЕ
		|	Вопросы.Вид = &Вид
		|	И Вопросы.Раздел = &Раздел
		|	И НЕ Вопросы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Раздел", Раздел);
	Запрос.УстановитьПараметр("Вид", Вид);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	
	ИндексВопроса = ПолучитьСлучайноеЧисло(ТаблицаРезультат.Количество());
	Возврат ТаблицаРезультат[ИндексВопроса].Ссылка; 
		
КонецФункции

Функция ПолучитьСлучайноеЧисло(ВерхняяГраница)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Возврат ГСЧ.СлучайноеЧисло(0, ВерхняяГраница);	
КонецФУнкции
